package com.uniwa.course_recommendation.utils;

import com.uniwa.course_recommendation.entity.Course;

public class PromptBuilder {
    public static String buildPrompt(UserProfile user, Course course) {
        return """
            Βοηθάς έναν φοιτητή να καταλάβει γιατί του προτάθηκε ένα μάθημα.
            
            ΜΗΝ αναφέρεις πόντους ή κανόνες ή ετικέτες. Μην προσθέτεις πληροφορίες που δεν υπάρχουν. Χρησιμοποίησε φιλικό και κατανοητό τόνο. Τα μαθήματα επιλέγονται βάση του score που έχουν σημειώσει σύμφωνα με τους κανόνες. Η απάντηση να είναι σε μορφή κουκκίδων.
            
            ΠΡΟΦΙΛ ΧΡΗΣΤΗ:
            - Ροή: %s
            - Ετικέτες Ροής: %s
            - Κατεύθυνση: %s
            - Ετικέτες Κατεύθυνσης: %s
            - Ενδιαφέροντα: %s
            - Ετικέτες Ενδιαφερόντων: %s
            
             ΜΑΘΗΜΑ:
            - Τίτλος: %s
            - Περιγραφή: %s
            - Ετικέτες: %s
            
            ΚΑΝΟΝΕΣ ΠΡΟΤΑΣΗΣ ΜΑΘΗΜΑΤΩΝ:
            - Αν το μάθημα σχετίζεται με τη ροή του φοιτητή, αυτό ενισχύει τη συνάφεια της πρότασης
            - Αν διαθέτει ετικέτες σχετικές με τα ενδιαφέροντα του φοιτητή, είναι σημαντικό, ιδιαίτερα αν προέρχεται από διαφορετική ροή
            - Αν διαθέτει ετικέτες που σχετίζονται με την κατεύθυνση του φοιτητή, αυτό υποστηρίζει την πρόταση

            Με βάση τα παραπάνω, εξήγησε σε κουκκίδες(3-4) γιατί αυτό το μάθημα ταιριάζει στο προφίλ του χρήστη."""
                .formatted(
                        user.getFlow(),
                        user.getFlowLabels(),
                        user.getSpecialization(),
                        user.getSpecializationLabels(),
                        user.getInterests(),
                        user.getInterestsLabels(),
                        course.getName(),
                        course.getShortDesc(),
                        course.getLabels()
                );
    }
}
